bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
    char * lcd_mem_reg = LCDMEM;

    /*
      I know that line above looks dumb, but if you just access LCDMEM directly the compiler does the wrong thing and loads the offset
      into a register rather than the base and this creates many wasted loads (LCDMEM=0x0620)...

            00c4e2:   403F 0010           MOV.W   #0x0010,R15
            00c4e6:   40FF 0060 0620      MOV.B   #0x0060,0x0620(R15)
            00c4ec:   403F 000E           MOV.W   #0x000e,R15
            00c4f0:   40FF 00F2 0620      MOV.B   #0x00f2,0x0620(R15)

      If we load it into a variable first, the compiler then gets wise and uses that as the base..

            00c4e2:   403F 0620           MOV.W   #0x0620,R15
            00c4e6:   40FF 0060 0010      MOV.B   #0x0060,0x0010(R15)
            00c4ec:   40FF 00F2 000E      MOV.B   #0x00f2,0x000e(R15)

     */

    if ( lcdmem_offset_a_thru_d == lcdmem_offset_e_thru_g  ) {

        // If the two L-pins for this digit are in the same memory location, we can update them both with a single byte write
        // Note that the whole process that gets us here is static at compile time, so the whole lcd_show() call will compile down
        // to just a single immediate byte write, which is very efficient.

        const char lpin_a_thru_d_nibble = lpin_t< lpin_a_thru_d >::nibble();

        if ( lpin_a_thru_d_nibble == nibble_t::LOWER  ) {

            // the A-D segments go into the lower nibble
            // the E-G segments go into the upper nibble

            lcd_mem_reg[lcdmem_offset_a_thru_d] = (char) ( nibble_e_thru_g << 4 ) | (nibble_a_thru_d);     // Combine the nibbles, write them to the mem address

        } else {

            // the A-D segments go into the lower nibble
            // the E-G segments go into the upper nibble

            lcd_mem_reg[lcdmem_offset_a_thru_d] = (char) ( nibble_a_thru_d << 4 ) | (nibble_e_thru_g);     // Combine the nibbles, write them to the mem address

        }

    } else {

        // The A-D segments are located on a pin that has a different address than the E-G segments, so we can to manually splice the nibbles into those two addresses

        // Write the a_thru_d nibble to the memory address is lives in

        const nibble_t lpin_a_thru_d_nibble_index = lpin_t< lpin_a_thru_d >::nibble();

        set_nibble( &lcd_mem_reg[lcdmem_offset_a_thru_d] , lpin_a_thru_d_nibble_index , nibble_a_thru_d );


        // Write the e_thru_f nibble to the memory address is lives in

        const nibble_t lpin_e_thru_g_nibble_index = lpin_t< lpin_e_thru_g >::nibble();

        set_nibble( &lcd_mem_reg[lcdmem_offset_e_thru_g] , lpin_e_thru_g_nibble_index , nibble_e_thru_g );

    }

}


volatile unsigned char * Seconds = &BAKMEM0_L;               // Store seconds in the backup RAM module
volatile unsigned char * Minutes = &BAKMEM0_H;               // Store minutes in the backup RAM module
volatile unsigned char * Hours = &BAKMEM1_L;                 // Store hours in the backup RAM module
volatile unsigned char * spin = &BAKMEM1_H;                 // Store hours in the backup RAM module


void Init_GPIO(void);

// test power consumption

int mainx( void )
{
    WDTCTL = WDTPW | WDTHOLD;                               // Stop watchdog timer

    // Disable the GPIO power-on default high-impedance mode
    // to activate previously configured port settings
    PM5CTL0 &= ~LOCKLPM5;

    // Configure all GPIO to Output Low
    P1OUT = 0x00;P2OUT = 0x00;P3OUT = 0x00;P4OUT = 0x00;
    P5OUT = 0x00;P6OUT = 0x00;P7OUT = 0x00;P8OUT = 0x00;

    P1DIR = 0xFF;P2DIR = 0xFF;P3DIR = 0xFF;P4DIR = 0xFF;
    P5DIR = 0xFF;P6DIR = 0xFF;P7DIR = 0xFF;P8DIR = 0xFF;

    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5

    return 0;

}

int main( void )
{
    WDTCTL = WDTPW | WDTHOLD;                               // Stop watchdog timer
    if ( 0 || SYSRSTIV == SYSRSTIV_LPM5WU)                        // If LPM3.5 wakeup
    {


        /*
         * When an overflow occurs, the RTCIFG bit in the RTCCTL register is set until it is cleared by a read of the
         * RTCIV register. At the same time, an interrupt is submitted to the CPU for post-processing, if the RTCIE
         * bit in the RTCCTL register is set. Reading RTCIV register clears the interrupt flag.
         */

        RTCIV; // Clear RTC interrupt. If we do not do this then the RTC ISR will be needlessly called when drop into LPM3.5


        // Initialize GPIO pins for low power
        Init_GPIO();



       CLOCK_IN_PDIR &= ~_BV( CLOCK_IN_B );
       // CLOCK_IN_POUT &= ~_BV( CLOCK_IN_B );
       CLOCK_IN_PREN |= _BV( CLOCK_IN_B );


       // Configure LCD pins
       SYSCFG2 |= LCDPCTL;


        // Disable the GPIO power-on default high-impedance mode
        // to activate previously configured port settings
        PM5CTL0 &= ~LOCKLPM5;


        //CLOCK_IN_PIV;   // Read and throw away to clear the PORT1 pin change interrupt flag. Only clears the top one but we only expect to have one.
        P1IFG = 0x00;

        CLOCK_IN_PIE |= _BV( CLOCK_IN_B );          // Enable interrupt on the clock_in pin. By default this will be low-to-high triggered


        // toggle low power waveform so we can see if it is visible (turns out only visible from wide viewing angles)
        // Divide by 1 (so CLK will be 10Khz), Very Low Osc, Turn on LCD, 4-mux selected (LCD4MUX also includes LCDSON), Low power waveform
        //LCDCTL0 ^= LCDLP ;

        switch (*Seconds) {

            case 0:
                *Seconds=1;
                lcd_show< 0,1>();
                break;

            case 1:
                *Seconds=2;
                lcd_show< 0,2>();
                break;

            case 2:
                *Seconds=3;
                lcd_show< 0,3>();
                break;

            case 3:
                *Seconds=4;
                lcd_show< 0,4>();
                break;

            case 4:
                *Seconds=5;
                lcd_show< 0,5>();
                break;

            case 5:
                *Seconds=6;
                lcd_show< 0,6>();
                break;

