bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
            case 6:
                *Seconds=7;
                lcd_show< 0,7>();
                break;

            case 7:
                *Seconds=8;
                lcd_show< 0,8>();
                break;

            case 8:
                *Seconds=9;
                lcd_show< 0,9>();
                break;

            case 9:
                *Seconds=0;
                lcd_show< 0,0>();
                break;


            default:
                *Seconds=0;
                lcd_show< 0,0>();
                break;

        }


        if (TBI(CLOCK_IN_PIN,CLOCK_IN_B)) {
            lcd_show<11,1>();
        } else {
            lcd_show<11,0>();

        }

        PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
        __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5

        // We never get here because LPM3.5 reboots on wake


    }
    else
    {

        //TODO: INit our own stack save the wastefull init
        //STACK_INIT();

        // Initialize GPIO pins for low power
        Init_GPIO();

        // Disable the GPIO power-on default high-impedance mode
        // to activate previously configured port settings
        PM5CTL0 &= ~LOCKLPM5;

        /*
            // This code is for testing LCD individual segments, it outputs out of phase square waves on MSP430 pins 1 and 2.
            // Connect one to SEG and one to COM and the segment should lite.
            while (1) {
                P7OUT = 0b10101010;
                __delay_cycles( 10000 );    // 100Hz
                P7OUT = 0b01010101;
                __delay_cycles( 10000 );    // 100Hz
            }
        */

        //*Seconds = 5;                                       // Set initial time to 12:00:00
        *Minutes = 0;
        *Hours = 10;

        //RTCCTL = RTCSS__VLOCLK ;                    // Initialize RTC to use VLO clock

        // Configure LCD pins
        SYSCFG2 |= LCDPCTL;                                 // LCD R13/R23/R33/LCDCAP0/LCDCAP1 pins enabled

        // TODO: We can make a template to compute these from logical_digits
        LCDPCTL0 = 0b1111111111111111;  // LCD pins L15-L00, 1=enabled
        LCDPCTL1 = 0b1111111111111111;  // LCD pins L31-L16, 1=enabled
        LCDPCTL2 = 0b0000000000001111;  // LCD pins L37-L32, 1=enabled

        // LCDCTL0 = LCDSSEL_0 | LCDDIV_7;                     // flcd ref freq is xtclk

        // TODO: Try different clocks and dividers

        // Divide by 2 (so CLK will be 10KHz/2= 5KHz), Very Low Osc, Turn on LCD, 4-mux selected (LCD4MUX also includes LCDSON)
        // Note this has a bit of a flicker
        //LCDCTL0 = LCDDIV_2 | LCDSSEL__VLOCLK | LCD4MUX | LCDSON | LCDON  ;

        // TODO: Try different clocks and dividers
        // Divide by 1 (so CLK will be 10Khz), Very Low Osc, Turn on LCD, 4-mux selected (LCD4MUX also includes LCDSON)
        //LCDCTL0 = LCDDIV_1 | LCDSSEL__VLOCLK | LCD4MUX | LCDSON | LCDON  ;

        // Divide by 1 (so CLK will be 10Khz), Very Low Osc, Turn on LCD, 4-mux selected (LCD4MUX also includes LCDSON), Low power saveform
        //LCDCTL0 = LCDDIV_1 | LCDSSEL__VLOCLK | LCD4MUX | LCDSON | LCDON | LCDLP ;

        // LCD using VLO clock, divide by 4 (on 10KHz from VLO) , 4-mux (LCD4MUX also includes LCDSON), low power waveform
        LCDCTL0 =  LCDSSEL__VLOCLK | LCDDIV__4 | LCD4MUX | LCDLP ;


/*
        // Divide by 32 (so CLK will be 32768/32 = ~1KHz), Very Low Osc, Turn on LCD, 4-mux selected (LCD4MUX also includes LCDSON)
        LCDCTL0 = LCDDIV_7 | LCDSSEL__XTCLK | LCD4MUX | LCDSON | LCDON  ;
*/


        // LCD Operation - Mode 3, internal 3.08v, charge pump 256Hz, 3.4uA
        //LCDVCTL = LCDCPEN | LCDREFEN | VLCD_6 | (LCDCPFSEL0 | LCDCPFSEL1 | LCDCPFSEL2 | LCDCPFSEL3);

        // LCD Operation - internal V1 regulator=3.32v , charge pump 256Hz
        // LCDVCTL = LCDCPEN | LCDREFEN | VLCD_12 | (LCDCPFSEL0 | LCDCPFSEL1 | LCDCPFSEL2 | LCDCPFSEL3);


        // LCD Operation - Pin R33 is connected to external Vcc, charge pump 256Hz, 1.7uA
        //LCDVCTL = LCDCPEN | LCDSELVDD | (LCDCPFSEL0 | LCDCPFSEL1 | LCDCPFSEL2 | LCDCPFSEL3);


        // LCD Operation - Pin R33 is connected to internal Vcc, no charge pump
        //LCDVCTL = LCDSELVDD;


        // LCD Operation - Pin R33 is connected to external V1, charge pump 256Hz, 1.7uA, Low Power Waveform
        //LCDVCTL = LCDCPEN | (LCDCPFSEL0 | LCDCPFSEL1 | LCDCPFSEL2 | LCDCPFSEL3);

        // LCD Operation - Charge pump enable, Vlcd=Vcc , charge pump FREQ=256Hz (lowest)
        LCDVCTL = LCDCPEN |  LCDSELVDD | (LCDCPFSEL0 | LCDCPFSEL1 | LCDCPFSEL2 | LCDCPFSEL3);

        //LCDMEMCTL |= LCDCLRM;                                      // Clear LCD memory

/*
        // For MSP430FR4133-EXP
         *
        LCDCSSEL0 = 0x000F;                                 // Configure COMs and SEGs
        LCDCSSEL1 = 0x0000;                                 // L0, L1, L2, L3: COM pins
        LCDCSSEL2 = 0x0000;

        LCDM0 = 0x21;                                       // L0 = COM0, L1 = COM1
        LCDM1 = 0x84;                                       // L2 = COM2, L3 = COM3
*/

        // For TSL
        // Configure COMs and SEGs
        LCDCSSEL0 = LCDCSS8 | LCDCSS9 | LCDCSS10 | LCDCSS11 ;     // L8-L11 are the 4 COM pins
        LCDCSSEL1 = 0x0000;
        LCDCSSEL2 = 0x0000;

        // L08 = MSP_COM3 = LCD_COM3
        // L09 = MSP_COM2 = LCD_COM2
        // L10 = MSP_COM1 = LCD_COM1
        // L11 = MSP_COM0 = LCD_COM0

        // Once we have selected the COM lines above, we have to connect them in the LCD memory. See Figure 17-2 in MSP430FR4x family guide.
        // Each nibble in the LCDMx regs holds 4 bits connecting the L pin to one of the 4 COM lines (two L pins per reg)

        LCDM4 =  0b01001000;  // L09=MSP_COM2  L08=MSP_COM3
        LCDM5 =  0b00010010;  // L10=MSP_COM0  L11=MSP_COM1


        LCDCTL0 |= LCDON;                                           // Turn on LCD

