bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
/*
        // Set up RTC



//        RTCMOD = 10000;                                     // Set RTC modulo to 10000 to trigger interrupt each second on 10Khz VLO clock. This will get loaded into the shadow register on next trigger or reset
        RTCMOD = 10000;                                     // Set RTC modulo to 1000 to trigger interrupt each 0.1 second on 10Khz VLO clock. This will get loaded into the shadow register on next trigger or reset

        RTCCTL |=  RTCSR;                    // reset RTC which will load overflow value into shadow reg and reset the counter to 0,  and generate RTC interrupt

        RTCIV;                      // Clear any pending RTC interrupt

        // TRY THIS, MUST ALSO ADJUST LCDSEL
        // Use VLO instead of XTAL
        //RTCCTL = RTCSS__VLOCLK | RTCIE;                    // Initialize RTC to use Very Low Oscillator and enable RTC interrupt on rollovert
        RTCCTL = 0x00;                    // Disable RTC

*/

/*
        lcd_show< 0,6>();
        P1DIR |= 1<<3;

        while (1) {

            P1OUT |= 1<<3;
            __delay_cycles(100);
            P1OUT &= ~(1<<3);
            __delay_cycles(100);

        }
*/
/*
        // Setup the RV3032

        i2c_init();

        uint8_t pmu_reg = 0b00000000;
        i2c_write( RV_3032_I2C_ADDR , 0xc0 , &pmu_reg , 1 ); // Default reg, Enable CLKOUT

        uint8_t save_flags_reg = 0b01100000;
        i2c_write( RV_3032_I2C_ADDR , 0xc3 , &save_flags_reg , 1 ); // Switch CLKOUT to 1 Hz


        //uint8_t pmu_reg = 0b01010000;       // No CLKOUT, Switchover when VDD < VBACKUP, Trickle Charger off
        //i2c_write( RV_3032_I2C_ADDR , 0xc0 , &pmu_reg , 1 ); // Disable CLKOUT


*/
        // OK now the RTC is sending a 1Hz clock out
        // Now we need to setup interrupt on clock_in pin to wake us


/*

       CLOCK_IN_PDIR &= ~_BV( CLOCK_IN_B );
       // CLOCK_IN_POUT &= ~_BV( CLOCK_IN_B );
       CLOCK_IN_PREN |= _BV( CLOCK_IN_B );


       P1IFG = 0x00;

       CLOCK_IN_PIE |= _BV( CLOCK_IN_B );          // Enable interrupt on the clock_in pin. By default this will be low-to-high triggered

*/


        // TODO: Why doesnt this work?
        //LCDMEMCTL |= LCDCLRM;                               // Clear LCD memory command (executed one shot)
        //while (LCDMEMCTL & LCDCLRM);                        // Wait for clear to complete before moving on

        lcd_show< 0,0>();
        lcd_show< 1,1>();
        lcd_show< 2,2>();
        lcd_show< 3,3>();
        lcd_show< 4,4>();
        lcd_show< 5,5>();
        lcd_show< 6,6>();
        lcd_show< 7,7>();
        lcd_show< 8,8>();
        lcd_show< 9,9>();
        lcd_show<10,0>();
        lcd_show<11,4>();



        spin++;

        if (*spin==1) {
            lcd_show<10,1>();
        } else {
            lcd_show<10,2>();
        }


        //Enter LPM3 with SVS off
        //PMMCTL0_L &= ~SVSHE ;                           // disable SVS (prob ~0.2uA, default is on)
        //TODO:Turn off LPM3.5 switch before sleeping? //LPM5SW

        // Datasheet says this will be 1.25uA with LCD...
        // Low-power mode 3, VLO, excludes SVS test conditions:
        // Current for watchdog timer clocked by VLO included. RTC disabled. Current for brownout included. SVS disabled (SVSHE = 0).
        // CPUOFF = 1, SCG0 = 1 SCG1 = 1, OSCOFF = 0 (LPM3),

        // "the WDTHOLD bit can be used to hold the WDTCNT, reducing power consumption."

        WDTCTL = WDTPW | WDTSSEL__VLO | WDTHOLD;                               // Select VLO for WDT clock, halt watchdog timer

        // "After reset, RTCSS defaults to 00b (disabled), which means that no clock source is selected."

/*

        PMMCTL0_H = PMMPW_H;                            // Open PMM Registers for write
        PMMCTL0_L &= ~SVSHE ;                           // disable SVS

        __bis_SR_register( CPUOFF | SCG1 | OSCOFF  );                 // Enter LPM3 with datasheet specified flags.

*/
        // Go into LPM3.5 sleep
        PMMCTL0_H = PMMPW_H;                               // Open PMM Registers for write
        PMMCTL0_L = PMMREGOFF_L;                           // and set PMMREGOFF also clears SVS
        // TODO: datasheets save SVS off makes wakeup 10x slower, so need to test when wake works

        __bis_SR_register( LPM3_bits |  GIE  );                    // Enter LPM3.5

        /*
        PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
        PMMCTL0_L = PMMREGOFF_L | SVSHE;                   // and set PMMREGOFF (go into a x.5 mode on next sleep) and disable low voltage monitor

        __bis_SR_register(LPM3_bits | GIE);                 // Enter LPM3.5
        __no_operation();                                   // For debugger
         */


    }
}


#pragma vector = PORT1_VECTOR

__interrupt void PORT1_ISR(void) {

    lcd_show< 8,1>();

}


#pragma vector = RTC_VECTOR

__interrupt void RTC_ISR(void) {

    lcd_show< 7,1>();


    // Currently we never make it here in LPM3.5

    //RTCIV;
    //__no_operation();                                   // For debugger


    //(LCDMEM[pos4])++;//= digit[4];

    /*

    (LCDMEM[pos2])= digit[1];


    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5

    (LCDMEM[pos2])= digit[6];

    */

    /*

    Inc_RTC();

    (LCDMEM[pos4]) = digit[4];

    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5
*/
}

void Init_GPIO()
{
    // Configure all GPIO to Output Low
    P1OUT = 0x00;P2OUT = 0x00;P3OUT = 0x00;P4OUT = 0x00;
    P5OUT = 0x00;P6OUT = 0x00;P7OUT = 0x00;P8OUT = 0x00;

    P1DIR = 0xFF;P2DIR = 0xFF;P3DIR = 0xFF;P4DIR = 0xFF;
    P5DIR = 0xFF;P6DIR = 0xFF;P7DIR = 0xFF;P8DIR = 0xFF;
}
